{
    "text": "Long ago, in a small village in Japan, an old man and woman lived together by the mountains. The man went out every day to cut grass and gather firewood, while the woman stayed home to wash clothes and cook meals. Though they were kind and hardworking, they had no children, and this made them very sad. One day, while the old woman was washing clothes at the river, she saw something round and pink floating toward her. It was a giant peach, bigger than any she had ever seen! She pulled it from the water and brought it home to show her husband. “Look what I found!” she said. “This peach is enormous! Let’s eat it together.” The old man agreed, and as he took out his knife to cut it open, the peach suddenly split in half by itself. Inside, instead of a pit, there was a baby boy, healthy and smiling. The couple was overjoyed. “This must be a gift from the heavens!” the old woman cried. They named the boy Momotaro, which means “Peach Boy,” because he had come from a peach. They raised him with love, feeding him rice, fish, and vegetables from their garden. Momotaro grew up strong, brave, and kind. Years passed, and Momotaro became a young man. One day, he heard terrible news—a band of oni (ogres) had been attacking villages on a distant island, stealing food, treasure, and even kidnapping people. The villagers were afraid, and no one dared to stand up to the oni. Momotaro went to his parents and said, “I must go to Oni Island and defeat these monsters.” The old man and woman were worried, but they knew their son was brave. His mother prepared special kibi dango (millet dumplings) for his journey, and his father gave him a sword and a banner with his name written on it. “Be careful,” they said as they waved goodbye. Momotaro set off down the road, determined to reach the coast where he could find a boat to Oni Island. As he walked, he met a dog with sharp teeth, who barked at him. “Where are you going, boy?” the dog asked. “I’m going to Oni Island to defeat the oni,” Momotaro replied. The dog’s ears perked up. “If you give me one of your dumplings, I’ll come with you!” Momotaro agreed and gave the dog a dumpling. The dog ate it happily and joined him. A little farther down the road, they met a monkey chattering in a tree. “Hey, where are you two going?” the monkey called. “We’re going to Oni Island to fight the oni,” Momotaro said. The monkey scratched his head. “If you give me a dumpling, I’ll help!” Momotaro handed him one, and the monkey climbed down to follow them. Not long after, they came across a pheasant pecking at the ground. “What’s all this?” the pheasant asked, flapping its wings. “We’re going to defeat the oni,” Momotaro explained. “I want to help too!” the pheasant said. “Give me a dumpling, and I’ll join you.” Momotaro gave the pheasant the last dumpling, and now he had three companions: the dog, the monkey, and the pheasant. Together, they continued toward the sea. When they reached the shore, they found an old fisherman mending his nets. “Excuse me,” Momotaro said. “We need a boat to go to Oni Island.” The fisherman looked shocked. “No one goes there! The oni will eat you alive!” But Momotaro insisted. Seeing his determination, the fisherman sighed and pointed to a small boat. “Take that one. But be careful—those oni are merciless.” The group climbed into the boat, and the pheasant flew ahead to scout while the dog and monkey helped row. The sea was calm at first, but as they neared Oni Island, dark clouds gathered, and the waves grew rough. When they landed, the island was eerily quiet. A path led up to a massive iron gate, guarded by two oni with clubs. “How do we get past them?” the monkey whispered. The pheasant flapped its wings. “I’ll distract them!” It flew up and pecked at the guards’ heads, making them shout and swing their clubs wildly. While they were distracted, the dog dashed forward and bit one oni’s leg, while the monkey climbed the gate and unlocked it from the inside. Momotaro drew his sword. “Now!” They rushed inside the oni fortress, where the leader—a giant oni with three horns—sat on a throne made of bones. “Who dares enter my domain?” the oni roared. “I am Momotaro!” the boy shouted. “And we’ve come to stop your evil deeds!” The oni laughed and swung his spiked club. The battle began—Momotaro fought with his sword, the dog bit at the oni’s ankles, the monkey climbed onto his back, and the pheasant pecked at his eyes. The other oni in the fortress tried to help their leader, but Momotaro and his companions were too quick. One by one, the oni fell, until finally, the leader dropped to his knees. “Enough!” he cried. “We surrender!” Momotaro lowered his sword. “Then return everything you’ve stolen and promise never to harm humans again.” The oni leader agreed, and his minions hurried to bring out chests of gold, bags of rice, and even the prisoners they had taken. Momotaro and his friends loaded the treasure and freed villagers onto their boat. As they sailed away, the oni watched from the shore, defeated. When they returned home, the villagers cheered. Momotaro’s parents wept with joy, proud of their son. The dog, monkey, and pheasant became his lifelong friends, and the village lived in peace from that day on."
}